{
  "_name_or_path": "pszemraj/flan-t5-large-grammar-synthesis-v6",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_ff": 2816,
  "d_kv": 64,
  "d_model": 1024,
  "decoder_start_token_id": 0,
  "dense_act_fn": "gelu",
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "gelu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "is_gated_act": true,
  "layer_norm_epsilon": 1e-06,
  "max_length": 512,
  "min_length": 8,
  "model_type": "t5",
  "n_positions": 512,
  "no_repeat_ngram_size": 4,
  "num_beams": 2,
  "num_decoder_layers": 24,
  "num_heads": 16,
  "num_layers": 24,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_max_distance": 128,
  "relative_attention_num_buckets": 32,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.25.0.dev0",
  "use_cache": true,
  "vocab_size": 32128
}
